MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/PIC24FJ128GA108/hal_ll_pps_connection_defs.h
    {GPIO_PIN_0, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 0, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB1_RP1
    {GPIO_PIN_1, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 1, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB14_RP14
    {GPIO_PIN_14, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 14, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB15_RP29
    {GPIO_PIN_15, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 29, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB2_RP13
    {GPIO_PIN_2, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 13, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB4_RP28
    {GPIO_PIN_4, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 28, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB5_RP18
    {GPIO_PIN_5, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 18, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB6_RP6
    {GPIO_PIN_6, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 6, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB7_RP7
    {GPIO_PIN_7, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 7, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB8_RP8
    {GPIO_PIN_8, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 8, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RB9_RP9
    {GPIO_PIN_9, GPIO_PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 9, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC1_RPI38
    {GPIO_PIN_1, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 38, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC14_RPI37
    {GPIO_PIN_14, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 37, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC3_RPI40
    {GPIO_PIN_3, GPIO_PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 40, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD0_RP11
    {GPIO_PIN_0, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 11, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD1_RP24
    {GPIO_PIN_1, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 24, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD10_RP3
    {GPIO_PIN_10, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 3, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD11_RP12
    {GPIO_PIN_11, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 12, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD12_RPI42
    {GPIO_PIN_12, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 42, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD14_RPI43
    {GPIO_PIN_14, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 43, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD15_RP5
    {GPIO_PIN_15, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 5, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD2_RP23
    {GPIO_PIN_2, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 23, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD3_RP22
    {GPIO_PIN_3, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 22, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD4_RP25
    {GPIO_PIN_4, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 25, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD5_RP20
    {GPIO_PIN_5, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 20, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD8_RP2
    {GPIO_PIN_8, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 2, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD9_RP4
    {GPIO_PIN_9, GPIO_PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 4, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE8_RPI33
    {GPIO_PIN_8, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 33, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE9_RPI34
    {GPIO_PIN_9, GPIO_PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 34, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF2_RP30
    {GPIO_PIN_2, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 30, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF3_RP16
    {GPIO_PIN_3, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 16, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF4_RP10
    {GPIO_PIN_4, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 10, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF5_RP17
    {GPIO_PIN_5, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 17, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF6_RPI45
    {GPIO_PIN_6, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 45, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF7_RPI44
    {GPIO_PIN_7, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 44, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF8_RP15
    {GPIO_PIN_8, GPIO_PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 15, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG6_RP21
    {GPIO_PIN_6, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 21, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG7_RP26
    {GPIO_PIN_7, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 26, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG8_RP19
    {GPIO_PIN_8, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 19, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG9_RP27
    {GPIO_PIN_9, GPIO_PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 27, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR28_REG_ADDRESS},
    #endif

    { HAL_LL_PIN_NC, HAL_LL_PORT_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_MODULE_ERROR }
};

